
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |    Change |    Destroy |
|----------:|---------:|----------:|-----------:|
|        ✅ |      136 |         0 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                                      |
|:--------:|:---------------------------------------------------------------------------------------------------------------|
|    🟢    | `module.actions-runner.aws_autoscaling_group.actions-runner`                                                   |
|    🟢    | `module.actions-runner.aws_autoscaling_lifecycle_hook.terminating`                                             |
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_in`                                                        |
|    🟢    | `module.actions-runner.aws_autoscaling_policy.scale_out`                                                       |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high`                                          |
|    🟢    | `module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low`                                           |
|    🟢    | `module.actions-runner.aws_iam_policy.required`                                                                |
|    🟢    | `module.actions-runner.aws_key_pair.actions-runner`                                                            |
|    🟢    | `module.actions-runner.aws_launch_template.actions-runner`                                                     |
|    🟢    | `module.actions-runner.aws_s3_bucket.lambda_tmp`                                                               |
|    🟢    | `module.actions-runner.aws_s3_bucket_public_access_block.public_access`                                        |
|    🟢    | `module.actions-runner.aws_security_group.actions-runner`                                                      |
|    🟢    | `module.actions-runner.aws_vpc_security_group_egress_rule.default`                                             |
|    🟢    | `module.actions-runner.aws_vpc_security_group_ingress_rule.icmp`                                               |
|    🟢    | `module.actions-runner.aws_vpc_security_group_ingress_rule.ssh`                                                |
|    🟢    | `module.actions-runner.random_string.asg_name`                                                                 |
|    🟢    | `module.actions-runner.random_string.profile-suffix`                                                           |
|    🟢    | `module.actions-runner.random_string.reg_token_suffix`                                                         |
|    🟢    | `module.actions-runner.tls_private_key.actions-runner`                                                         |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_group.actions-runner`                                             |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating`                                       |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_in`                                                  |
|    🟢    | `module.actions-runner-noble.aws_autoscaling_policy.scale_out`                                                 |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high`                                    |
|    🟢    | `module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low`                                     |
|    🟢    | `module.actions-runner-noble.aws_iam_policy.required`                                                          |
|    🟢    | `module.actions-runner-noble.aws_key_pair.actions-runner`                                                      |
|    🟢    | `module.actions-runner-noble.aws_launch_template.actions-runner`                                               |
|    🟢    | `module.actions-runner-noble.aws_s3_bucket.lambda_tmp`                                                         |
|    🟢    | `module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access`                                  |
|    🟢    | `module.actions-runner-noble.aws_security_group.actions-runner`                                                |
|    🟢    | `module.actions-runner-noble.aws_vpc_security_group_egress_rule.default`                                       |
|    🟢    | `module.actions-runner-noble.aws_vpc_security_group_ingress_rule.icmp`                                         |
|    🟢    | `module.actions-runner-noble.aws_vpc_security_group_ingress_rule.ssh`                                          |
|    🟢    | `module.actions-runner-noble.random_string.asg_name`                                                           |
|    🟢    | `module.actions-runner-noble.random_string.profile-suffix`                                                     |
|    🟢    | `module.actions-runner-noble.random_string.reg_token_suffix`                                                   |
|    🟢    | `module.actions-runner-noble.tls_private_key.actions-runner`                                                   |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.run_every`                              |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_event_target.lambda_target`                        |
|    🟢    | `module.actions-runner.module.deregistration.aws_cloudwatch_log_group.lambda`                                  |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_logging`                                    |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions`                                |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role.iam_for_lambda`                                      |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`       |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_logs`                       |
|    🟢    | `module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions`                |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_function.lambda`                                       |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_function_event_invoke_config.update_filter`            |
|    🟢    | `module.actions-runner.module.deregistration.aws_lambda_permission.allow_eventbridge`                          |
|    🟢    | `module.actions-runner.module.deregistration.aws_s3_object.lambda_package`                                     |
|    🟢    | `module.actions-runner.module.deregistration.null_resource.install_python_dependencies`                        |
|    🟢    | `module.actions-runner.module.deregistration.random_uuid.lamda_src_hash`                                       |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile`                               |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_policy.profile`                                         |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_role.profile`                                           |
|    🟢    | `module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.profile`                         |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every`                               |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target`                         |
|    🟢    | `module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda`                                   |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging`                                     |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions`                                 |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda`                                       |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`        |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                        |
|    🟢    | `module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`                 |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`                                        |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`             |
|    🟢    | `module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge`                           |
|    🟢    | `module.actions-runner.module.record_metric.aws_s3_object.lambda_package`                                      |
|    🟢    | `module.actions-runner.module.record_metric.null_resource.install_python_dependencies`                         |
|    🟢    | `module.actions-runner.module.record_metric.random_uuid.lamda_src_hash`                                        |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale`                                    |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_event_target.scale-in-out`                           |
|    🟢    | `module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda`                                    |
|    🟢    | `module.actions-runner.module.registration.aws_iam_policy.lambda_logging`                                      |
|    🟢    | `module.actions-runner.module.registration.aws_iam_policy.lambda_permissions`                                  |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role.lambda`                                                |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`         |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_logs`                         |
|    🟢    | `module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_permissions`                  |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_function.main`                                           |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_function_event_invoke_config.runner_registration`        |
|    🟢    | `module.actions-runner.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`          |
|    🟢    | `module.actions-runner.module.registration.aws_s3_object.lambda_package`                                       |
|    🟢    | `module.actions-runner.module.registration.null_resource.install_python_dependencies`                          |
|    🟢    | `module.actions-runner.module.registration.random_uuid.lamda_src_hash`                                         |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.run_every`                        |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.lambda_target`                  |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_cloudwatch_log_group.lambda`                            |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_logging`                              |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions`                          |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role.iam_for_lambda`                                |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole` |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_logs`                 |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions`          |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda`                                 |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_function_event_invoke_config.update_filter`      |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge`                    |
|    🟢    | `module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package`                               |
|    🟢    | `module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies`                  |
|    🟢    | `module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash`                                 |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_instance_profile.profile`                         |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile`                                   |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_role.profile`                                     |
|    🟢    | `module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.profile`                   |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every`                         |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target`                   |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda`                             |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging`                               |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions`                           |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda`                                 |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`  |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs`                  |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions`           |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda`                                  |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter`       |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge`                     |
|    🟢    | `module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package`                                |
|    🟢    | `module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies`                   |
|    🟢    | `module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash`                                  |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale`                              |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out`                     |
|    🟢    | `module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda`                              |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging`                                |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions`                            |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role.lambda`                                          |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole`   |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs`                   |
|    🟢    | `module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions`            |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_function.main`                                     |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration`  |
|    🟢    | `module.actions-runner-noble.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook`    |
|    🟢    | `module.actions-runner-noble.module.registration.aws_s3_object.lambda_package`                                 |
|    🟢    | `module.actions-runner-noble.module.registration.null_resource.install_python_dependencies`                    |
|    🟢    | `module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash`                                   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = []

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:SetInstanceHealth",
              + "autoscaling:SetInstanceProtection",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner.aws_autoscaling_group.actions-runner will be created
  + resource "aws_autoscaling_group" "actions-runner" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 900
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 432000
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-004bd6d011ea52557",
          + "subnet-0dbff142ba4620c5f",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "registration"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 3600
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "bootstrap"
            # (3 unchanged attributes hidden)
        }

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override (known after apply)
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "303467602807"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-303467602807"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/actions-runner/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "development"
        }
      + tag {
          + key                 = "lambda_name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }

      + traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }
    }

  # module.actions-runner.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 3600
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "deregistration"
    }

  # module.actions-runner.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = (known after apply)
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = (known after apply)
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.actions-runner.aws_key_pair.actions-runner will be created
  + resource "aws_key_pair" "actions-runner" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "actions-runner-generated-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all        = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.aws_launch_template.actions-runner will be created
  + resource "aws_launch_template" "actions-runner" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-000a1bde8afe0c325"
      + instance_type          = "t3a.small"
      + key_name               = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner-"
      + tags                   = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 64
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
    }

  # module.actions-runner.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-action-runner-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner.aws_security_group.actions-runner will be created
  + resource "aws_security_group" "actions-runner" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to GitHub Actions runner"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + vpc_id                 = "vpc-045eb4d598bc177c0"
    }

  # module.actions-runner.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = -1
    }

  # module.actions-runner.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = 22
    }

  # module.actions-runner.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.random_string.reg_token_suffix will be created
  + resource "random_string" "reg_token_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner.tls_private_key.actions-runner will be created
  + resource "tls_private_key" "actions-runner" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.actions-runner-noble.data.aws_iam_policy_document.required_permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = []

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:SetInstanceHealth",
              + "autoscaling:SetInstanceProtection",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner-noble.aws_autoscaling_group.actions-runner will be created
  + resource "aws_autoscaling_group" "actions-runner" {
      + arn                              = (known after apply)
      + availability_zones               = (known after apply)
      + default_cooldown                 = (known after apply)
      + desired_capacity                 = (known after apply)
      + force_delete                     = false
      + force_delete_warm_pool           = false
      + health_check_grace_period        = 900
      + health_check_type                = (known after apply)
      + id                               = (known after apply)
      + ignore_failed_scaling_activities = false
      + load_balancers                   = (known after apply)
      + max_instance_lifetime            = 432000
      + max_size                         = 3
      + metrics_granularity              = "1Minute"
      + min_size                         = 1
      + name                             = (known after apply)
      + name_prefix                      = (known after apply)
      + predicted_capacity               = (known after apply)
      + protect_from_scale_in            = false
      + service_linked_role_arn          = (known after apply)
      + target_group_arns                = (known after apply)
      + vpc_zone_identifier              = [
          + "subnet-004bd6d011ea52557",
          + "subnet-0dbff142ba4620c5f",
        ]
      + wait_for_capacity_timeout        = "10m"
      + warm_pool_size                   = (known after apply)

      + availability_zone_distribution (known after apply)

      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 300
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "registration"
            # (3 unchanged attributes hidden)
        }
      + initial_lifecycle_hook {
          + default_result          = "ABANDON"
          + heartbeat_timeout       = 3600
          + lifecycle_transition    = "autoscaling:EC2_INSTANCE_LAUNCHING"
          + name                    = "bootstrap"
            # (3 unchanged attributes hidden)
        }

      + instance_refresh {
          + strategy = "Rolling"

          + preferences {
              + max_healthy_percentage       = 100
              + min_healthy_percentage       = 100
              + scale_in_protected_instances = "Ignore"
              + skip_matching                = false
              + standby_instances            = "Ignore"
            }
        }

      + launch_template (known after apply)

      + mixed_instances_policy {
          + instances_distribution {
              + on_demand_allocation_strategy            = (known after apply)
              + on_demand_base_capacity                  = 0
              + on_demand_percentage_above_base_capacity = 0
              + spot_allocation_strategy                 = (known after apply)
              + spot_instance_pools                      = (known after apply)
            }
          + launch_template {
              + launch_template_specification {
                  + launch_template_id   = (known after apply)
                  + launch_template_name = (known after apply)
                  + version              = (known after apply)
                }
              + override (known after apply)
            }
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }
      + tag {
          + key                 = "account"
          + propagate_at_launch = true
          + value               = "303467602807"
        }
      + tag {
          + key                 = "created_by"
          + propagate_at_launch = true
          + value               = "infrahouse/aws-control-303467602807"
        }
      + tag {
          + key                 = "created_by_module"
          + propagate_at_launch = true
          + value               = "infrahouse/actions-runner/aws"
        }
      + tag {
          + key                 = "environment"
          + propagate_at_launch = true
          + value               = "development"
        }
      + tag {
          + key                 = "lambda_name"
          + propagate_at_launch = true
          + value               = (known after apply)
        }
      + tag {
          + key                 = "service"
          + propagate_at_launch = true
          + value               = "actions-runner"
        }

      + traffic_source (known after apply)

      + warm_pool {
          + max_group_prepared_capacity = 2
          + min_size                    = 2
          + pool_state                  = "Hibernated"

          + instance_reuse_policy {
              + reuse_on_scale_in = true
            }
        }
    }

  # module.actions-runner-noble.aws_autoscaling_lifecycle_hook.terminating will be created
  + resource "aws_autoscaling_lifecycle_hook" "terminating" {
      + autoscaling_group_name = (known after apply)
      + default_result         = "ABANDON"
      + heartbeat_timeout      = 3600
      + id                     = (known after apply)
      + lifecycle_transition   = "autoscaling:EC2_INSTANCE_TERMINATING"
      + name                   = "deregistration"
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_in will be created
  + resource "aws_autoscaling_policy" "scale_in" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-in-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = -1
    }

  # module.actions-runner-noble.aws_autoscaling_policy.scale_out will be created
  + resource "aws_autoscaling_policy" "scale_out" {
      + adjustment_type         = "ChangeInCapacity"
      + arn                     = (known after apply)
      + autoscaling_group_name  = (known after apply)
      + cooldown                = 180
      + enabled                 = true
      + id                      = (known after apply)
      + metric_aggregation_type = (known after apply)
      + name                    = "scale-out-idle-runners"
      + policy_type             = "SimpleScaling"
      + scaling_adjustment      = 1
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_high will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_high" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Too many idle runners"
      + alarm_name                            = (known after apply)
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_cloudwatch_metric_alarm.idle_runners_low will be created
  + resource "aws_cloudwatch_metric_alarm" "idle_runners_low" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "Idle runners below safe threshold"
      + alarm_name                            = (known after apply)
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = (known after apply)
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "IdleRunners"
      + namespace                             = "GitHubRunners"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

  # module.actions-runner-noble.aws_iam_policy.required will be created
  + resource "aws_iam_policy" "required" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "created_by" = "infrahouse/aws-control-303467602807"
        }
    }

  # module.actions-runner-noble.aws_key_pair.actions-runner will be created
  + resource "aws_key_pair" "actions-runner" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = (known after apply)
      + key_name_prefix = "actions-runner-generated-"
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (known after apply)
      + tags            = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all        = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.aws_launch_template.actions-runner will be created
  + resource "aws_launch_template" "actions-runner" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-0f852f6b9cdfac2a8"
      + instance_type          = "t3a.small"
      + key_name               = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner-"
      + tags                   = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + iops                  = (known after apply)
              + throughput            = (known after apply)
              + volume_size           = 64
              + volume_type           = (known after apply)
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "account"           = "303467602807"
              + "created_by"        = "infrahouse/aws-control-303467602807"
              + "created_by_module" = "infrahouse/actions-runner/aws"
              + "environment"       = "development"
              + "service"           = "actions-runner"
            }
        }
    }

  # module.actions-runner-noble.aws_s3_bucket.lambda_tmp will be created
  + resource "aws_s3_bucket" "lambda_tmp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "infrahouse-action-runner-lambda-"
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all                    = {
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.actions-runner-noble.aws_s3_bucket_public_access_block.public_access will be created
  + resource "aws_s3_bucket_public_access_block" "public_access" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.actions-runner-noble.aws_security_group.actions-runner will be created
  + resource "aws_security_group" "actions-runner" {
      + arn                    = (known after apply)
      + description            = "Manage traffic to GitHub Actions runner"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "actions-runner"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "actions-runner"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + vpc_id                 = "vpc-045eb4d598bc177c0"
    }

  # module.actions-runner-noble.aws_vpc_security_group_egress_rule.default will be created
  + resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "outgoing traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
    }

  # module.actions-runner-noble.aws_vpc_security_group_ingress_rule.icmp will be created
  + resource "aws_vpc_security_group_ingress_rule" "icmp" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all ICMP traffic"
      + from_port              = -1
      + id                     = (known after apply)
      + ip_protocol            = "icmp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "ICMP traffic"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = -1
    }

  # module.actions-runner-noble.aws_vpc_security_group_ingress_rule.ssh will be created
  + resource "aws_vpc_security_group_ingress_rule" "ssh" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/22"
      + description            = "Allow SSH traffic"
      + from_port              = 22
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + tags_all               = {
          + "Name"              = "SSH access"
          + "account"           = "303467602807"
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/actions-runner/aws"
          + "environment"       = "development"
          + "service"           = "actions-runner"
        }
      + to_port                = 22
    }

  # module.actions-runner-noble.random_string.asg_name will be created
  + resource "random_string" "asg_name" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner-noble.random_string.profile-suffix will be created
  + resource "random_string" "profile-suffix" {
      + id          = (known after apply)
      + length      = 12
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner-noble.random_string.reg_token_suffix will be created
  + resource "random_string" "reg_token_suffix" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

  # module.actions-runner-noble.tls_private_key.actions-runner will be created
  + resource "tls_private_key" "actions-runner" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.actions-runner.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.deregistration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeWarmPool",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DeleteSecret",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner.module.deregistration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags                = (known after apply)
      + tags_all            = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.deregistration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.deregistration.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.deregistration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.deregistration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "0ca4a122c64f37b43518510e62641af2"
        }
    }

  # module.actions-runner.module.deregistration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "0ca4a122c64f37b43518510e62641af2"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "actions-runner-oracular"
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id   = (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
    }

  # module.actions-runner.module.instance-profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "actions-runner-oracular"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.instance-profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "actions-runner-oracular"
    }

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags                = (known after apply)
      + tags_all            = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "a502cf8854b179715a96efb141e4e72a"
          + "main_version"         = "38c7850f0e812a275d4d5235aa4bd045"
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "38c7850f0e812a275d4d5235aa4bd045"
          + "requirements.txt" = "a502cf8854b179715a96efb141e4e72a"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.registration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:RecordLifecycleActionHeartbeat",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:303467602807:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:PutSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags           = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner.module.registration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner.module.registration.aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner.module.registration.aws_lambda_function_event_invoke_config.runner_registration will be created
  + resource "aws_lambda_function_event_invoke_config" "runner_registration" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner.module.registration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner.module.registration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "95d3cdd170c6143cae4d84604cb4c6e9"
        }
    }

  # module.actions-runner.module.registration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "95d3cdd170c6143cae4d84604cb4c6e9"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.actions-runner-noble.module.deregistration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_deregistration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.deregistration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingGroups",
              + "autoscaling:DescribeAutoScalingInstances",
              + "autoscaling:DescribeWarmPool",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DeleteSecret",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner-noble.module.deregistration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags                = (known after apply)
      + tags_all            = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.deregistration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.deregistration.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.deregistration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "0ca4a122c64f37b43518510e62641af2"
        }
    }

  # module.actions-runner-noble.module.deregistration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "0ca4a122c64f37b43518510e62641af2"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_instance_profile.profile will be created
  + resource "aws_iam_instance_profile" "profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "actions-runner-noble"
      + tags        = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id   = (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_policy.profile will be created
  + resource "aws_iam_policy" "profile" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all         = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_role.profile will be created
  + resource "aws_iam_role" "profile" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "actions-runner-noble"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-303467602807"
          + "created_by_module" = "infrahouse/instance-profile/aws"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.instance-profile.aws_iam_role_policy_attachment.profile will be created
  + resource "aws_iam_role_policy_attachment" "profile" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "actions-runner-noble"
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_rule.run_every will be created
  + resource "aws_cloudwatch_event_rule" "run_every" {
      + arn                 = (known after apply)
      + description         = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = (known after apply)
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(1 minute)"
      + tags                = (known after apply)
      + tags_all            = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_event_target.lambda_target will be created
  + resource "aws_cloudwatch_event_target" "lambda_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "send-to-lambda"
    }

  # module.actions-runner-noble.module.record_metric.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:GetCallerIdentity"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "autoscaling:DescribeAutoScalingGroups"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "cloudwatch:PutMetricData"
                      + Condition = {
                          + StringEquals = {
                              + "cloudwatch:namespace" = "GitHubRunners"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function_event_invoke_config.update_filter will be created
  + resource "aws_lambda_function_event_invoke_config" "update_filter" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_permission.allow_eventbridge will be created
  + resource "aws_lambda_permission" "allow_eventbridge" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromEventBridge"
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "a502cf8854b179715a96efb141e4e72a"
          + "main_version"         = "38c7850f0e812a275d4d5235aa4bd045"
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "38c7850f0e812a275d4d5235aa4bd045"
          + "requirements.txt" = "a502cf8854b179715a96efb141e4e72a"
        }
      + result  = (known after apply)
    }

  # module.actions-runner-noble.module.registration.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/runner_registration/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.registration.data.aws_iam_policy_document.lambda-permissions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:CompleteLifecycleAction",
              + "autoscaling:RecordLifecycleActionHeartbeat",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
              + "ec2:DescribeTags",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + resources = [
              + "arn:aws:ec2:*:303467602807:instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:us-west-1:303467602807:secret:action-runner-pem-20241116182707976200000001-zz0FRP",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:CreateSecret",
              + "secretsmanager:DeleteSecret",
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:PutSecretValue",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.actions-runner-noble.module.registration.data.aws_iam_policy_document.lambda_logging will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_logging" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:us-west-1:303467602807:log-group:*:log-stream:*",
            ]
        }
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_rule.scale will be created
  + resource "aws_cloudwatch_event_rule" "scale" {
      + arn            = (known after apply)
      + description    = "ASG lifecycle hook"
      + event_bus_name = "default"
      + event_pattern  = (known after apply)
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = (known after apply)
      + tags           = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_event_target.scale-in-out will be created
  + resource "aws_cloudwatch_event_target" "scale-in-out" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_cloudwatch_log_group.lambda will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + retention_in_days = 365
      + skip_destroy      = false
      + tags              = (known after apply)
      + tags_all          = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_logging will be created
  + resource "aws_iam_policy" "lambda_logging" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for logging from a lambda"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_logging"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_policy.lambda_permissions will be created
  + resource "aws_iam_policy" "lambda_permissions" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM policy for a lambda permissions"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "lambda_permissions"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "infrahouse-registration"
      + path                  = "/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole will be created
  + resource "aws_iam_role_policy_attachment" "AWSLambdaBasicExecutionRole" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_logs will be created
  + resource "aws_iam_role_policy_attachment" "lambda_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_iam_role_policy_attachment.lambda_permissions will be created
  + resource "aws_iam_role_policy_attachment" "lambda_permissions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function.main will be created
  + resource "aws_lambda_function" "main" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = (known after apply)
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + s3_bucket                      = (known after apply)
      + s3_key                         = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_lambda_function_event_invoke_config.runner_registration will be created
  + resource "aws_lambda_function_event_invoke_config" "runner_registration" {
      + function_name          = (known after apply)
      + id                     = (known after apply)
      + maximum_retry_attempts = 0
    }

  # module.actions-runner-noble.module.registration.aws_lambda_permission.allow_cloudwatch_asg_lifecycle_hook will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_asg_lifecycle_hook" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = (known after apply)
      + statement_id_prefix = (known after apply)
    }

  # module.actions-runner-noble.module.registration.aws_s3_object.lambda_package will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = (known after apply)
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = (known after apply)
      + storage_class          = (known after apply)
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.actions-runner-noble.module.registration.null_resource.install_python_dependencies will be created
  + resource "null_resource" "install_python_dependencies" {
      + id       = (known after apply)
      + triggers = {
          + "dependencies_version" = "d2d150575969dfe5ad34d9383f06a744"
          + "main_version"         = "95d3cdd170c6143cae4d84604cb4c6e9"
        }
    }

  # module.actions-runner-noble.module.registration.random_uuid.lamda_src_hash will be created
  + resource "random_uuid" "lamda_src_hash" {
      + id      = (known after apply)
      + keepers = {
          + "main.py"          = "95d3cdd170c6143cae4d84604cb4c6e9"
          + "requirements.txt" = "d2d150575969dfe5ad34d9383f06a744"
        }
      + result  = (known after apply)
    }

  # module.actions-runner-noble.module.userdata.data.cloudinit_config.config will be read during apply
  # (config refers to values not yet known)
 <= data "cloudinit_config" "config" {
      + base64_encode = true
      + boundary      = (known after apply)
      + gzip          = false
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

Plan: 136 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDEzNiwgImNoYW5nZSI6IDAsICJkZXN0cm95IjogMH19
```
</details>